ryanhaus/rowan-baja-daq/can-module/software/vendor/mplab/spi_base/src/packs/PIC32CM1216JH01048_DFP/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-02-18T10:55:45Z  */
#ifndef _PIC32CMJH01_FUSES_COMPONENT_H_
#define _PIC32CMJH01_FUSES_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR FUSES                      */
/* ************************************************************************** */

/* -------- FUSES_LOCKBIT_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) LOCKBIT Page Word 0 -------- */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos _UINT32_(24)                                         /* (FUSES_LOCKBIT_WORD_0) CEHL Bits Position */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Msk (_UINT32_(0x3F) << FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos) /* (FUSES_LOCKBIT_WORD_0) CEHL Bits Mask */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL(value) (FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Msk & (_UINT32_(value) << FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos)) /* Assignment of value for NVMCTRL_CEHL in the FUSES_LOCKBIT_WORD_0 register */
#define FUSES_LOCKBIT_WORD_0_Msk              _UINT32_(0x3F000000)                                 /* (FUSES_LOCKBIT_WORD_0) Register Mask  */


/* -------- FUSES_OTP1_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) OTP1 Page Word 0 -------- */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos _UINT32_(0)                                          /* (FUSES_OTP1_WORD_0) NVM Lock Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Msk (_UINT32_(0xFF) << FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos) /* (FUSES_OTP1_WORD_0) NVM Lock Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK(value) (FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos)) /* Assignment of value for NVMCTRL_NVM_LOCK in the FUSES_OTP1_WORD_0 register */
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos     _UINT32_(8)                                          /* (FUSES_OTP1_WORD_0) NVM Page Size Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Msk     (_UINT32_(0x3) << FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos) /* (FUSES_OTP1_WORD_0) NVM Page Size Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ(value)  (FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos)) /* Assignment of value for NVMCTRL_PSZ in the FUSES_OTP1_WORD_0 register */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos    _UINT32_(16)                                         /* (FUSES_OTP1_WORD_0) Number of NVM Pages Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Msk    (_UINT32_(0x3FFF) << FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos) /* (FUSES_OTP1_WORD_0) Number of NVM Pages Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP(value) (FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos)) /* Assignment of value for NVMCTRL_NVMP in the FUSES_OTP1_WORD_0 register */
#define FUSES_OTP1_WORD_0_Msk                 _UINT32_(0x3FFF03FF)                                 /* (FUSES_OTP1_WORD_0) Register Mask  */


/* -------- FUSES_OTP1_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP1 Page Word 1 -------- */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos _UINT32_(0)                                          /* (FUSES_OTP1_WORD_1) Number of Data Flash Pages Position */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Msk (_UINT32_(0xFF) << FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos) /* (FUSES_OTP1_WORD_1) Number of Data Flash Pages Mask */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP(value) (FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Msk & (_UINT32_(value) << FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos)) /* Assignment of value for NVMCTRL_DATAFLASHP in the FUSES_OTP1_WORD_1 register */
#define FUSES_OTP1_WORD_1_Msk                 _UINT32_(0x000000FF)                                 /* (FUSES_OTP1_WORD_1) Register Mask  */


/* -------- FUSES_OTP2_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP2 Page Word 1 -------- */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos _UINT32_(16)                                         /* (FUSES_OTP2_WORD_1) Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Msk (_UINT32_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos) /* (FUSES_OTP2_WORD_1) Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Msk & (_UINT32_(value) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos)) /* Assignment of value for NVMCTRL_ECCDIS_NOTPRESENT in the FUSES_OTP2_WORD_1 register */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos _UINT32_(17)                                         /* (FUSES_OTP2_WORD_1) Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Msk (_UINT32_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos) /* (FUSES_OTP2_WORD_1) Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Msk & (_UINT32_(value) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos)) /* Assignment of value for NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT in the FUSES_OTP2_WORD_1 register */
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos _UINT32_(18)                                         /* (FUSES_OTP2_WORD_1) Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Msk (_UINT32_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos) /* (FUSES_OTP2_WORD_1) Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Msk & (_UINT32_(value) << FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos)) /* Assignment of value for NVMCTRL_CEHL_NOTPRESENT in the FUSES_OTP2_WORD_1 register */
#define FUSES_OTP2_WORD_1_Msk                 _UINT32_(0x00070000)                                 /* (FUSES_OTP2_WORD_1) Register Mask  */


/* -------- FUSES_OTP3_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP3 Page Word 1 -------- */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos  _UINT32_(31)                                         /* (FUSES_OTP3_WORD_1) Dummy for OTP3 entry Position */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Msk  (_UINT32_(0x1) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos) /* (FUSES_OTP3_WORD_1) Dummy for OTP3 entry Mask */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2(value) (FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Msk & (_UINT32_(value) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos)) /* Assignment of value for NVMCTRL_DUMMY2 in the FUSES_OTP3_WORD_1 register */
#define FUSES_OTP3_WORD_1_Msk                 _UINT32_(0x80000000)                                 /* (FUSES_OTP3_WORD_1) Register Mask  */

#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos   _UINT32_(31)                                         /* (FUSES_OTP3_WORD_1 Position) Dummy for OTP3 entry */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Msk   (_UINT32_(0x1) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos) /* (FUSES_OTP3_WORD_1 Mask) NVMCTRL_DUMMY */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY(value) (FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Msk & (_UINT32_(value) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos)) 

