ryanhaus/rowan-baja-daq/can-module/software/vendor/mplab/spi_base/src/packs/PIC32CM1216JH01048_DFP/component/fuses.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* LOCKBIT_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_LOCKBIT_WORD_0; /* Offset: 0x00 (R/   32) LOCKBIT Page Word 0 */
} fuses_lockbit_fuses_registers_t;

/* OTP1_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_OTP1_WORD_0;  /* Offset: 0x00 (R/   32) OTP1 Page Word 0 */
  __I   uint32_t                       FUSES_OTP1_WORD_1;  /* Offset: 0x04 (R/   32) OTP1 Page Word 1 */
} fuses_otp1_fuses_registers_t;

/* OTP2_FUSES register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       FUSES_OTP2_WORD_1;  /* Offset: 0x04 (R/   32) OTP2 Page Word 1 */
} fuses_otp2_fuses_registers_t;

/* OTP3_FUSES register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       FUSES_OTP3_WORD_1;  /* Offset: 0x04 (R/   32) OTP3 Page Word 1 */
} fuses_otp3_fuses_registers_t;

/* OTP4_FUSES register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       FUSES_OTP4_WORD_1;  /* Offset: 0x04 (R/   32) OTP4 Page Word 1 */
} fuses_otp4_fuses_registers_t;

/* OTP5_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_OTP5_WORD_0;  /* Offset: 0x00 (R/   32) OTP5 Page Word 0 */
} fuses_otp5_fuses_registers_t;

/* USER_FUSES register API structure */
typedef struct
{
  __IO  uint32_t                       FUSES_USER_WORD_0;  /* Offset: 0x00 (R/W  32) USER Page Word 0 */
  __IO  uint32_t                       FUSES_USER_WORD_1;  /* Offset: 0x04 (R/W  32) USER Page Word 1 */
} fuses_user_fuses_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMJH01_FUSES_COMPONENT_H_ */
